In [88]:
import numpy as np
import pandas as pd

In [89]:
df1=pd.DataFrame({"Name":["Shashi","kishan","Rahul","Neeraj",np.NaN,"Sushant"],
                  "Qualification":["B.Tech",np.NaN,"BBA","BCA","MBA","MCA"],
                  "Roll No":[11407,11408,np.NaN,11410,np.NaN,11234],
                  "Percentage":[79.0,45,68,np.NaN,78,89]
                 })

In [90]:
print(df1)

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
1   kishan           NaN  11408.0        45.0
2    Rahul           BBA      NaN        68.0
3   Neeraj           BCA  11410.0         NaN
4      NaN           MBA      NaN        78.0
5  Sushant           MCA  11234.0        89.0

In [91]:
df1.head(3)

     Name Qualification  Roll No  Percentage
0  Shashi        B.Tech  11407.0        79.0
1  kishan           NaN  11408.0        45.0
2   Rahul           BBA      NaN        68.0

In [92]:
df1.transpose()

                    0       1      2       3    4        5
Name           Shashi  kishan  Rahul  Neeraj  NaN  Sushant
Qualification  B.Tech     NaN    BBA     BCA  MBA      MCA
Roll No         11407   11408    NaN   11410  NaN    11234
Percentage         79      45     68     NaN   78       89

In [93]:
df1.shape

(6, 4)

In [94]:
df1.size

24

In [95]:
np.sum(df1.isnull())

Name             1
Qualification    1
Roll No          2
Percentage       1
dtype: int64

In [96]:
np.sum(df1["Roll No"].isnull())

2

In [97]:
df1.shape

(6, 4)

In [98]:
df1

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
1   kishan           NaN  11408.0        45.0
2    Rahul           BBA      NaN        68.0
3   Neeraj           BCA  11410.0         NaN
4      NaN           MBA      NaN        78.0
5  Sushant           MCA  11234.0        89.0

In [99]:
 np.sum(np.sum(df1.isnull())/df1.shape[0]>.20) #to find the no of columns with more than 10% of data missing

1

In [118]:
df1["Roll No"].shape

(6,)

In [122]:
np.sum(df1[["Roll No","Percentage"]].isnull())/df1[["Roll No","Percentage"]].shape[0]*100

Roll No       33.333333
Percentage    16.666667
dtype: float64

In [123]:
np.sum(df1.isnull())/df1.shape[0]*100

Name             16.666667
Qualification    16.666667
Roll No          33.333333
Percentage       16.666667
dtype: float64

In [149]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [155]:
df1["Percentage"].fillna(df1["Percentage"].median())

0    79.0
1    45.0
2    68.0
3    78.0
4    78.0
5    89.0
Name: Percentage, dtype: float64

In [83]:
np.sum(df1["Percentage"].isnull())/df1["Percentage"].shape*100

array([16.66666667])

In [38]:
set(df1.columns[df1.isnull().mean()>0.20])

{'Roll No'}

In [39]:
df1["Roll No"].isna().count

<bound method Series.count of 0    False
1    False
2     True
3    False
4     True
5    False
Name: Roll No, dtype: bool>

In [40]:
df1.count()

Name             5
Qualification    5
Roll No          4
Percentage       5
dtype: int64

In [41]:
df1

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
1   kishan           NaN  11408.0        45.0
2    Rahul           BBA      NaN        68.0
3   Neeraj           BCA  11410.0         NaN
4      NaN           MBA      NaN        78.0
5  Sushant           MCA  11234.0        89.0

In [42]:
df1.isna().any()

Name             True
Qualification    True
Roll No          True
Percentage       True
dtype: bool

In [43]:
df1.dropna()

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
5  Sushant           MCA  11234.0        89.0

In [44]:
df1.dropna(axis=0)

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
5  Sushant           MCA  11234.0        89.0

In [45]:
df1.dropna(axis=0)

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
5  Sushant           MCA  11234.0        89.0

In [46]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [47]:
df1.dropna(thresh=1)

      Name Qualification  Roll No  Percentage
0   Shashi        B.Tech  11407.0        79.0
1   kishan           NaN  11408.0        45.0
2    Rahul           BBA      NaN        68.0
3   Neeraj           BCA  11410.0         NaN
4      NaN           MBA      NaN        78.0
5  Sushant           MCA  11234.0        89.0

In [48]:
df1.fillna(value='DEFAULT')

      Name Qualification  Roll No Percentage
0   Shashi        B.Tech    11407         79
1   kishan       DEFAULT    11408         45
2    Rahul           BBA  DEFAULT         68
3   Neeraj           BCA    11410    DEFAULT
4  DEFAULT           MBA  DEFAULT         78
5  Sushant           MCA    11234         89

In [49]:
df1['Roll No'].fillna(value=df1['Roll No'].mean())

0    11407.00
1    11408.00
2    11364.75
3    11410.00
4    11364.75
5    11234.00
Name: Roll No, dtype: float64